# nums = [10,20,30,40,50,60]

# print(nums[2:4])


# letters = ['a', 'b', 'c', 'd', 'e']
# print(letters[1:4])


# nums = [1, 2, 3, 4, 5, 6]
# print(nums[-1:-4:-1])

# a = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# # 짝수 인덱스에 있는 값들만 슬라이싱으로 가져오세요.
# # 결과: [0, 2, 4, 6, 8]
# print(a[0::2])

# a = ['a', 'b', 'c', 'd', 'e']
# # 리스트를 역순으로 만들어보세요. ['e', 'd', 'c', 'b', 'a']
# print(a[::-1])


# a = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# # 인덱스 7부터 1까지 거꾸로 슬라이싱하세요.
# # 결과: [7, 6, 5, 4, 3, 2, 1]
# print(a[7:0:-1])


# nums = [1, 2, 3, 4, 5, 6 , 7, 8, 9]
# print(nums[-3::])

# a = [1, 2, 3, 4, 5]
# # 슬라이싱을 사용하여 중간 요소 3개를 [100, 200, 300]으로 바꾸세요.
# # 결과: [1, 100, 200, 300, 5]
# a[1:4] = [100, 200, 300]
# print(a)


# a = [10, 20, 30, 40, 50]
# # [20, 30, 40]을 [200, 300, 400]으로 교체
# # 결과: [10, 200, 300, 400, 50]

# a[1:4] = [200 , 300 , 400]
# print(a)



# a = [1, 2, 3, 4, 5]
# # [2, 3]을 [100] 하나로 바꿔보세요
# # 결과: [1, 100, 4, 5]
# a[1:3] = [100]
# print(a)


a = ['a', 'b', 'c', 'd', 'e']
# ['b', 'c', 'd']를 삭제해서 ['a', 'e']로 만들어보세요

a[1:4] = []

print(a)



# print(a[::-1][:3])
