# 1. 목표 정하기	
	# 무엇을 구해야 하는가?	
	# "점수를 등급으로 바꾸는 것"
# 2. 재료 정리	문제에서 어떤 정보가 주어졌는가?	
	# "점수(0~100), 점수 구간, 등급"
# 3. 변환 흐름 설계	주어진 재료로 목표를 얻기 위한 절차는?	
	# "점수를 이용해 어느 구간에 속하는지 판단 → 그에 맞는 등급 출력"

# 1단계: 목표 파악
# 연도가 주어졌을 때, 윤년이면 1, 아니면 0을 출력하는 프로그램을 작성
# 윤년은 연도가 4의 배수이면서, 100의 배수가 아닐 때 또는 400의 배수일 때이다

# 2단계: 재료 추출
# 보다 크거나 같고, 4000보다 작거나 같은 자연수

#만약 (연도 % 4 == 0 동시에 연도 % 100 == 0 이면) 또는
# 연도% 400 == 0 이면 1출력
#그외 0출력

a = int(input())
result = 0

if a % 4 == 0 and (a % 100 != 0 or a % 400 == 0):
    result = 1
else:
    result = 0
    
print(result)
