# n번 : n숫자 바구니의 갯수
# m번 : m 번의 변화
"""
n , m = map(int,input().spilt())

반복문을 돌려서?
1-2
3-4
1-4
2-2  
몇번이 나오는지 m이 가르쳐주니까 m에 숫자 5가 나오면 저렇게 5번이 나온다
일단 n으로 바구니를 구현하는게 맞나
바구니 어찌 구현하지?
자 바구니는 구현햇당 
자그럼 이제 변화를 어찌할지 생각해보자
일단 변화가 몇번 일어나는지를 가르쳐준다 

4를 받으면 4번 변화한다느 소리다 이건 반복문 몇번 변화를 반복하냐는 말이니까
그다음 저 숫자 1-2일경우 1에서 2까지를 역순으로 만든다는 소리인데
이거 인덱싱 밖에 없지않나?
근데 저 입력되는 값을 어찌 받아오지? 1,2 3,4 이걸 하나하나 받는건 불가능하고




값을 받앗다 치면?
kago[i,j,-1] 하면 되는거 아님?
여기서 i j 를 받앗다 치면 

이논리가 틀렷네 ㅠ 근데 값 받는법은 알앗엉

1-2
만약 1 - 4가 나왓다 
1 2 3 4 5
그럼 
4 3 2 1 5 가됨
i 가 첫번째 j가 두번째



kago[i] , kago[j] = kago[j] , kago[i]
내가대가리가 생각은해봣는데 
1 - 4
4  2  3  1
몇개를 받는지모르니



"""

a = [1 , 2, 3]

print(a.reverse())

p = "hello"

